# # 태어난  연도 입력, 만나이 출력
# num = int(input("출생 연도를 입력해 주세요:"))
# print(f"귀하의 현재 만 나이는 {2024 - num}세 입니다")
#
# # 세 개의 숫자를 입력받고 총합, 평균 출력
# n1 = float(input("첫번째 숫자:"))
# n2 = float(input("두번째 숫자:"))
# n3 = float(input("세번째 숫자:"))
# print(f"세 숫자의 총합은 {n1 + n2 + n3}이고, 세 숫자의 평균은 {(n1 + n2 + n3)/3}입니다")

#변수 : .2f 둘째 자리 까지만 출력

# 반지름 입력, 원의 넓이 둘레 구하기
r = float(input("원의 반지름은?:"))
print(f"반지름에 따른 원의 둘레는 {r * 2 * 3.14}이고, 넓이는 {r**2 * 3.14}입니다")

# 변수 - 임시 저장
# int() / float() / str()

